app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "hello rails"], ["body", "hahaha"], ["created_at", "2020-12-26 10:39:30.795749"], ["updated_at", "2020-12-26 10:39:30.795749"], ["user_id", 1]]